<template>
  <div class="banner">
    <div class="hero">
      {{ banner }}
    </div>
    <div class="version">
      v1.0.0
    </div>
    <div class="welcome">
      __Welcome on my page 🎊 <br>
      __Type 'help' to see the list of available commands__
      
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent, onMounted, ref } from 'vue';
import useProccess from '@/composables/useProccess';

export default defineComponent ({
  name: 'banner',
  setup() {
    const { startProccess, endProccess } = useProccess();

    const banner = ref<string>(
` █████╗ ██████╗  ██████╗ ██████╗  ██████╗ ████████╗██╗  ██╗ ██████╗ ███╗   ██╗ ██████╗
██╔══██╗██╔══██╗██╔═══██╗██╔══██╗██╔═══██╗╚══██╔══╝██║ ██╔╝██╔═══██╗████╗  ██║██╔════╝
███████║██║  ██║██║   ██║██║  ██║██║   ██║   ██║   █████╔╝ ██║   ██║██╔██╗ ██║██║  ███╗
██╔══██║██║  ██║██║   ██║██║  ██║██║   ██║   ██║   ██╔═██╗ ██║   ██║██║╚██╗██║██║   ██║
██║  ██║██████╔╝╚██████╔╝██████╔╝╚██████╔╝   ██║   ██║  ██╗╚██████╔╝██║ ╚████║╚██████╔╝
╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚═════╝  ╚═════╝    ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═══╝ ╚═════╝`);
    
    onMounted(() => {
      endProccess();
    })
    
    return { banner }
  }
})  
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="scss">
.banner {
  white-space: pre;
  margin: 15px 0;
}
.version {
  text-align: right;
}
.welcome {
  color: var(--green);
}


</style>