<template>
  <div class="banner">
    <div class="hero" v-for="line in banner">
      {{ line }}
    </div>
    <div class="version">
      v1.0.0
    </div>
    <div class="welcome">
      __Welcome on my page 🎊 <br>
      __Type 'help' to see the list of available commands__
      
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent, ref } from 'vue';

export default defineComponent ({
  name: 'banner',
  setup() {
    const banner = ref<string[]>([
' █████╗ ██████╗  ██████╗ ██████╗  ██████╗ ████████╗██╗  ██╗ ██████╗ ███╗   ██╗ ██████╗',
'██╔══██╗██╔══██╗██╔═══██╗██╔══██╗██╔═══██╗╚══██╔══╝██║ ██╔╝██╔═══██╗████╗  ██║██╔════╝',
'███████║██║  ██║██║   ██║██║  ██║██║   ██║   ██║   █████╔╝ ██║   ██║██╔██╗ ██║██║  ███╗',
'██╔══██║██║  ██║██║   ██║██║  ██║██║   ██║   ██║   ██╔═██╗ ██║   ██║██║╚██╗██║██║   ██║',
'██║  ██║██████╔╝╚██████╔╝██████╔╝╚██████╔╝   ██║   ██║  ██╗╚██████╔╝██║ ╚████║╚██████╔╝',
'╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚═════╝  ╚═════╝    ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═══╝ ╚═════╝']);
    return { banner }
  }
})  
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="scss">
.banner {
  white-space: pre;
  margin: 15px 0;
}
.version {
  text-align: right;
}
.welcome {
  color: var(--green);
}


</style>